# Задача №37. 
# Дано натуральное число N и
# последовательность из N элементов.
# Требуется вывести эту последовательность в
# обратном порядке.
# Примечание. В программе запрещается
# объявлять массивы и использовать циклы
# (даже для ввода и вывода).
# Input: 2 -> 3 4
# Output: 4 3
# sales = { 'apple': 2, 'orange': 3, 'grapes': 4 } 
# print(sales.values())
sales = { 'apple': 2, 'orange': 3, 5: 4 } 
values = sales.values()
print('Original items:', values)
 # delete an item from dictionary del[sales['apple']] print('Updated items:', values)
del[sales[5]] 
print('Updated items:', values)

