#Задача 2:
#Найдите сумму цифр трехзначного числа. 
#123 -> 6 (1 + 2 + 3)
#100 -> 1 (1 + 0 + 0)
num = int(input('Введите трехзначное число:'))
sumNum = num%10 + num//10%10 + num//100
print(f'Сумма трехзначного числа: {sumNum}')
print(sumNum := num%10 + num//10%10+ num//100)
num_1 = input('Введите трехзначное число:')
print(sum := int(num_1[0]) + int(num_1[1]) + int(num_1[2]))
